{
  "docus" : [
    {
      "_id": 0,
      "title": "Archimedes Trajano",
      "content": "<p>Archimedes Trajano was only 21 when he questioned Imee Marcos on why she was the National Chairman of the Kabataang Barangay during an open forum. He was forcibly taken from the venue by Imee's bodyguards, and was tortured and thrown out of a building window<strong>, </strong>all because the presidential daughter was irked by his question.</p>"
    },
    {
      "_id": 1,
      "title": "Maria Elena Ang",
      "content": "<p>Maria Elena Ang was a 23-year-old UP Journalism student when she was arrested and detained. She was beaten, electrocuted, water cured, and sexually violated during her detention.</p>"
    },
    {
      "_id": 2,
      "title": "Dr Juan Escandor",
      "content": "<p>Dr Juan Escandor was a young doctor with UP-PGH who was tortured and killed by the Philippine Constabulary. When his body was recovered, a pathologist found that his skull had been broken open, emptied and stuffed with trash, plastic bags, rags and underwear. His brain was stuffed inside his abdominal cavity.</p>"
    },
    {
      "_id": 3,
      "title": "Boyet Mijares",
      "content": "<p>Boyet Mijares was only 16 years old in 1977 when he received a call that his disappeared father (whistleblower and writer Primitivo Mijares) was still alive. The caller invited the younger Mijares to see him. A few days later, Boyet's body was found dumped outside Manila, his eyeballs protruding, his chest perforated with multiple stab wounds, his head bashed in, and his hands, feet and genitals mangled.</p>"
    },
    {
      "_id": 4,
      "title": "Detention without Due Process",
      "content": "<p>Previously, around 8,000 individuals, including senators, civil libertarians, journalists, students, and labor leaders, were arrested and detained without due process upon the declaration of martial law.</p><p>Source: Rigoberto Tiglao, “The Consolidation of the Dictatorship,” in Dictatorship and Revolution: Roots of People’s Power, eds. Aurora Javate-De Dios, Petronilo Bn. Daroy, and Lorna Kalaw-Tirol (Manila: Conspectus Foundation Inc., 1988), 26</p>"
    },
    {
      "_id": 5,
      "title": "Supression of Press Freedom",
      "content": "<p>Marcos issued at least eleven Presidential Decrees that suppressed press freedom. Journalists who did not comply with the new restrictions faced physical threats, libel suits, or forced resignation.[9] With such stringent censorship regulations, most of the periodicals that were allowed to operate were crony newspapers, such as Benjamin Romualdez’s Times Journal, Hans Menzi’s Bulletin Today, and Roberto Benedicto’s Philippine Daily Express. These newspapers offered “bootlicking reportage” on the country’s economy while completelx`y eschewing political issues.[10]</p><p>Source: Gerald Sussman, “Politics and the Press: The Philippines Since Marcos,” Philippine Studies 36, no. 4 (1988): 495.</p><p>Source: Tiglao, “The Consolidation of the Dictatorship,” 30.</p>"
    },
    {
      "_id": 6,
      "title": "The Collapse of the Philippine Economy",
      "content": "<p>Economist James Boyce commented, “If the central aim of economic development is the reduction of poverty, then the Philippine development strategy in the Marcos era was an abysmal failure.”[51] In the last years of the Marcos regime, the Philippine economy was almost grinding to a halt. This was so, despite the fact that the Marcos administration implemented its three-pronged development strategy: (1) The green revolution[52] in agriculture[53], (2) growth and diversity in agricultural and forestry exports, and (3) massive external borrowing. The profit from these three strategies were amassed disproportionately to the wealthiest in the population, thereby causing a large disparity between the rich and the poor.</p><p>Source:James K. Boyce, The Political Economy of Growth and Impoverishment in the Marcos Era, (Quezon City: Ateneo de Manila University Press, 1993), 347.</p>"
    },
    {
      "_id": 7,
      "title": "The Collapse of the Philippine Economy",
      "content": "<p>Economist James Boyce commented, “If the central aim of economic development is the reduction of poverty, then the Philippine development strategy in the Marcos era was an abysmal failure.”[51] In the last years of the Marcos regime, the Philippine economy was almost grinding to a halt. This was so, despite the fact that the Marcos administration implemented its three-pronged development strategy: (1) The green revolution[52] in agriculture[53], (2) growth and diversity in agricultural and forestry exports, and (3) massive external borrowing. The profit from these three strategies were amassed disproportionately to the wealthiest in the population, thereby causing a large disparity between the rich and the poor.</p><p>Source:James K. Boyce, The Political Economy of Growth and Impoverishment in the Marcos Era, (Quezon City: Ateneo de Manila University Press, 1993), 347.</p>"
    }
  ]
}